"""KeyError - когато ключ за съпоставяне не е намерен в съществуващите ключове"""

"""AttributeError - когато препратката към атрибута или присвояването е неуспешно"""

"""ValueError - когато операция или функция получи аргумент с правилен тип, но неподходяща стойност"""

"""NameError - когато не е намерено локално или глобално име. Това се отнася само за неквалифицирани имена."""

"""TypeError - когато операция или функция се прилага към обект от неподходящ тип."""

"""IndexError - когато долен индекс на последователност е извън обхвата."""

"""ModuleNotFoundError - когато модул не може да бъде локализиран при импортиране, също така когато се открие None"""

"""ZeroDivisionError - когато вторият аргумент на деление или операция по модул е нула"""

"""RuntimeError - когато се открие грешка, която не попада в никоя от другите категории"""

"""FileNotFoundError - когато файл или директория е поискан, но не съществува"""

"""OSError - когато системна функция върне свързана със системата грешка, като „файлът не е намерен“ или „дискът е пълен“"""